<?php

//----Задание №1 
echo "<br>"."<br>"."<br>".'Задание №1'."<br>"."<br>";

$x = 10;
$y = 23;

$z = ($x+(2+$y)/pow($x,2))/($y+(1/(sqrt($x+10))));
echo $z."<br>";

$q = 2.8*sin($x)+abs($y);
echo $q;

//----Задание №2 
echo "<br>"."<br>"."<br>".'Задание №2'."<br>"."<br>";

$timeRem = 15210; //Число секунд с начала суток

echo 'Заданное число секунд: ' .$timeRem ."<br>";

$intHors = floor($timeRem / 3600);; //Прошло целых часов

echo 'Целых часов: '.$intHors."<br>";

$MinToBe = floor((($timeRem/60))-($intHors*60)); // Прошло минут от последнего часа

echo 'Минут с начала часа: '.$MinToBe."<br>";

$SekToBe = $timeRem - (floor($timeRem / 60)*60);// Прошло секунд с начала очередной минуты

echo 'Секунд с начала очередной минуты: '.$SekToBe."<br>"."<br>"."<br>";

//----Задание №3 
echo "<br>"."<br>"."<br>".'Задание №3'."<br>"."<br>";

$xx = 5;

if ($x > 0) {
    $yy = pow(sin($xx),2);
} else {
    $yy = 1-2*(pow(sin($xx),2));
}

echo $yy ;

//----Задание №4 
echo "<br>"."<br>"."<br>".'Задание №4'."<br>"."<br>";

$cost = 20.4; //Число секунд с начала суток

for ($i=2; $i <= 20; $i++) { 
    echo 'Стоимость '.$i. ': '.$cost * $i."<br>";
}

//----Задание №5
echo "<br>"."<br>"."<br>".'Задание №5'."<br>"."<br>";

echo 'Целые числа от 100-200 кратные 3'."<br>";

for ($i=100; $i <= 200; $i++) { 
    
    if ($i%3 == 0) {
        echo $i."<br>";
    }
}


//----Задание №6
echo "<br>"."<br>"."<br>".'Задание №6'."<br>"."<br>";

echo 'Дан город: '.'Волгоград'."<br>";

$str = 'Волгоград';

if (strlen($str)%2 == 0) { // Только для русских букв
    echo "Количество символов четноe";
} else {
   echo "Количество символов не четноe";
}


//------Задание №7
echo "<br>"."<br>"."<br>".'Задание №7'."<br>"."<br>";


$string = 'jszdknvkasdlkn';
echo 'Строка: '.$string."<br>";

if ($string[1] == $string[3]) { 
    echo "Cимволы 2 и 4 одинаковые";
} else {
   echo "Символы 2 и 4 отличаются";
}

?>